### 회원가입 (FR-01)

| Actor action | System response |
| --- | --- |
|  | 1. 회원가입 화면을 표시한다. |
| 2. ID, 비밀번호, 전화번호를 입력하고 제출한다. |  |
|  | 3. 회원가입이 완료되었다는 메시지를 보여준다. |

### 로그인 (FR-02)

| Actor action | System response |
| --- | --- |
|  | 1. 로그인 화면(ID·비밀번호 입력창)을 표시한다. |
| 2a. ID와 비밀번호를 입력하고 로그인 버튼을 누른다. |  |
|  | 3a. 로그인이 완료 되었다는 메시지를 보여준다.  |
| 2b. 잘못된  ID와 비밀번호를 입력하고 로그인 버튼을 누른다. |  |
|  | 3b. 로그인이 실패했다는 메시지를 보여주고 로그인 화면으로 돌아간다. |

### 로그아웃 (FR-03)

| Actor action | System response |
| --- | --- |
|  | 1. 현재 세션이 유지되고 있다. |
| 2. ‘로그아웃’ 메뉴를 선택한다. |  |
|  | 3. 세션을 무효화하고 로그아웃 완료 메시지를 표시한다. |

### 자전거 등록 (FR-04)

| Actor action | System response |
| --- | --- |
|  | 1. 자전거 등록 화면(ID·제품명 입력)을 표시한다. |
| 2. 자전거 ID와 제품명을 입력하고 등록 버튼을 누른다. |  |
|  | 3. 필수 입력값을 검증하고 성공 시 등록 완료 메시지를 표시한다. |
|  |  |

### 자전거 대여 (FR-05)

| Actor action | System response |
| --- | --- |
|  | 1. 대여 가능한 자전거 목록을 표시한다. |
| 2. 특정 자전거를 선택하고 대여 버튼을 누른다. |  |
|  | 3. 대여 성공 시 대여 성공 메시지를 보여준다. |

### 대여 정보 조회 (FR-06)

| Actor action | System response |
| --- | --- |
| 1. 대여 중인 자전거 조회하기 버튼을 클릭한다. |  |
|  | 2. 대여 중인 자전거 리스트를 보여준다. 각 항목에는 자전거 ID, 자전거 제품명이 표시된다. |
